//
//  Graph.swift
//  MetroMap
//
//  Created by Роман Мисников on 17.05.2018.
//  Copyright © 2018 Роман Мисников. All rights reserved.
//

import Foundation

class MetroModel {
    
//    начало\конец             0  1  2  3  4  5
//    "Петроградская"       0 [0, 4, 0, 3, 0, 0]
//    "Горьковская"         1 [0, 0, 0, 2, 0, 3]
//    "Невский проспект"    2 [0, 0, 0, 0, 0, 0]
//    "Садовая"             3 [0, 0, 0, 0, 6, 0]
//    "Фрунзенская"         4 [2, 0, 1, 0, 0, 0]
//    "Московская"          5 [1, 0, 0, 0, 0, 0]
    
//    from 2 to 0
//    0 1 2 3 4 5
//
    
    static let names = ["Сенная площадь", "Пушкинская", "Технологический институт - 1/1", "Технологический институт - 1/2", "Технологический институт - 2/1", "Технологический институт - 2/2", "Вестибюль тех.инст. 1", "Вестибюль тех.инст. 2", "Фрунзенская", "Балтийская"]
    
    private static let inputArray = [[0, 0, 3, 0, 0, 0, 0, 0, 0, 0],
                                     [0, 0, 0, 2, 0, 0, 0, 0, 0, 0],
                                     [0, 0, 0, 1, 4, 4, 2, 0, 2, 0],
                                     [0, 0, 1, 0, 4, 4, 2, 0, 0, 2],
                                     [3, 0, 4, 4, 0, 1, 0, 2, 0, 0],
                                     [0, 2, 4, 4, 1, 0, 0, 2, 0, 0],
                                     [0, 0, 2, 2, 0, 0, 0, 0, 0, 0],
                                     [0, 0, 0, 0, 2, 2, 0, 0, 0, 0],
                                     [0, 0, 0, 0, 2, 0, 0, 0, 0, 0],
                                     [0, 0, 0, 0, 0, 2, 0, 0, 0, 0]]
    
    static let graph = Matrix(inputArray)
    
}

